bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32GBK1CBT6.svd
            <register>
               <name>ECR</name>
               <displayName>ECR</displayName>
               <description>DMA control register</description>
               <addressOffset>0x58</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IE</name>
                     <description>Index Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IDIR</name>
                     <description>Index Direction</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>IBLK</name>
                     <description>Index Blanking</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>FIDX</name>
                     <description>First Index</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IPOS</name>
                     <description>Index Positioning</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PW</name>
                     <description>Pulse width</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>PWPRSC</name>
                     <description>Pulse Width prescaler</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TISEL</name>
               <displayName>TISEL</displayName>
               <description>TIM timer input selection           register</description>
               <addressOffset>0x5C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TI1SEL</name>
                     <description>TI1[0] to TI1[15] input               selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TI2SEL</name>
                     <description>TI2[0] to TI2[15] input               selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TI3SEL</name>
                     <description>TI3[0] to TI3[15] input               selection</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TI4SEL</name>
                     <description>TI4[0] to TI4[15] input               selection</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AF1</name>
               <displayName>AF1</displayName>
               <description>TIM alternate function option register           1</description>
               <addressOffset>0x60</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ETRSEL</name>
                     <description>ETR source selection</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BKCMP4P</name>
                     <description>BRK COMP4 input polarity</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BKCMP3P</name>
                     <description>BRK COMP3 input polarity</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BKCMP2P</name>
                     <description>BRK COMP2 input polarity</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BKCMP1P</name>
                     <description>BRK COMP1 input polarity</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BKINP</name>
                     <description>BRK BKIN input polarity</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BKCMP7E</name>
                     <description>BRK COMP7 enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BKCMP6E</name>
                     <description>BRK COMP6 enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BKCMP5E</name>
                     <description>BRK COMP5 enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BKCMP4E</name>
                     <description>BRK COMP4 enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BKCMP3E</name>
                     <description>BRK COMP3 enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BKCMP2E</name>
                     <description>BRK COMP2 enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BKCMP1E</name>
                     <description>BRK COMP1 enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BKINE</name>
                     <description>BRK BKIN input enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AF2</name>
               <displayName>AF2</displayName>
               <description>TIM alternate function option register           2</description>
               <addressOffset>0x64</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OCRSEL</name>
                     <description>OCREF_CLR source selection</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>BK2CMP4P</name>
                     <description>BRK2 COMP4 input polarity</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BK2CMP3P</name>
                     <description>BRK2 COMP3 input polarity</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BK2CMP2P</name>
                     <description>BRK2 COMP2 input polarity</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BK2CMP1P</name>
                     <description>BRK2 COMP1 input polarity</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BK2INP</name>
                     <description>BRK2 BKIN input polarity</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BK2CMP7E</name>
                     <description>BRK2 COMP7 enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BK2CMP6E</name>
                     <description>BRK2 COMP6 enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BK2CMP5E</name>
                     <description>BRK2 COMP5 enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BK2CMP4E</name>
                     <description>BRK2 COMP4 enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BK2CMP3E</name>
                     <description>BRK2 COMP3 enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BK2CMP2E</name>
                     <description>BRK2 COMP2 enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BK2CMP1E</name>
                     <description>BRK2 COMP1 enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BKINE</name>
                     <description>BRK BKIN input enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DCR</name>
               <displayName>DCR</displayName>
               <description>control register</description>
               <addressOffset>0x3DC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DBL</name>
                     <description>DMA burst length</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DBA</name>
                     <description>DMA base address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DMAR</name>
               <displayName>DMAR</displayName>
               <description>DMA address for full transfer</description>
               <addressOffset>0x3E0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DMAB</name>
                     <description>DMA register for burst               accesses</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
