bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32GBK1CBT6.svd
         </registers>
     </peripheral> 	  					
	 <peripheral>
         <name>COMP</name>
         <description>Comparator control and status register</description>
         <groupName>COMP</groupName>
         <baseAddress>0x40010200</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x100</size>
            <usage>registers</usage>
         </addressBlock>
		 <interrupt>
            <name>COMP1_2_3</name>
            <description>COMP1_2_3</description>
            <value>64</value>
         </interrupt>
         <interrupt>
            <name>COMP4_5_6</name>
            <description>COMP4_5_6</description>
            <value>65</value>
         </interrupt>
         <interrupt>
            <name>COMP7</name>
            <description>COMP7</description>
            <value>66</value>
        </interrupt>		 	 
        <registers>
            <register>
               <name>COMP_C1CSR</name>
               <displayName>COMP_C1CSR</displayName>
               <description>Comparator control/status           register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>EN</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>INMSEL</name>
                     <description>INMSEL</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>INPSEL</name>
                     <description>INPSEL</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>POL</name>
                     <description>POL</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HYST</name>
                     <description>HYST</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BLANKSEL</name>
                     <description>BLANKSEL</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BRGEN</name>
                     <description>BRGEN</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SCALEN</name>
                     <description>SCALEN</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>VALUE</name>
                     <description>VALUE</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>LOCK</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>						
            <register>
               <name>COMP_C2CSR</name>
               <displayName>COMP_C2CSR</displayName>
               <description>Comparator control/status           register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>EN</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>INMSEL</name>
                     <description>INMSEL</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>INPSEL</name>
                     <description>INPSEL</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>POL</name>
                     <description>POL</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HYST</name>
                     <description>HYST</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BLANKSEL</name>
                     <description>BLANKSEL</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BRGEN</name>
                     <description>BRGEN</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SCALEN</name>
                     <description>SCALEN</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>VALUE</name>
                     <description>VALUE</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>LOCK</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>			
            <register>
               <name>COMP_C3CSR</name>
               <displayName>COMP_C3CSR</displayName>
               <description>Comparator control/status           register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>EN</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>INMSEL</name>
                     <description>INMSEL</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>INPSEL</name>
                     <description>INPSEL</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>POL</name>
                     <description>POL</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HYST</name>
                     <description>HYST</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BLANKSEL</name>
                     <description>BLANKSEL</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BRGEN</name>
                     <description>BRGEN</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SCALEN</name>
                     <description>SCALEN</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>VALUE</name>
                     <description>VALUE</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>LOCK</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>			
            <register>
               <name>COMP_C4CSR</name>
               <displayName>COMP_C4CSR</displayName>
               <description>Comparator control/status           register</description>
               <addressOffset>0x0C</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>EN</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>INMSEL</name>
                     <description>INMSEL</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>INPSEL</name>
                     <description>INPSEL</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>POL</name>
                     <description>POL</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HYST</name>
                     <description>HYST</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BLANKSEL</name>
                     <description>BLANKSEL</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BRGEN</name>
                     <description>BRGEN</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SCALEN</name>
                     <description>SCALEN</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>VALUE</name>
                     <description>VALUE</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>LOCK</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>				          		
